{
  "title": "平凡是程序员唯一的答案吗",
  "cells": [
    {
      "type": "text",
      "data": "<div><div><p>我在 Facebook 有一位好友。他本科国内 Top 2 大学毕业，在美国拿了最顶尖大学的硕士学位，然后年纪轻轻就做到了技术负责人，拿着超高的薪水。就是这么一个开了挂一般的天才，每个星期六晚上的夜里，他是永远是睡不着的。</p>\n<p>我问他为什么失眠。他的回答是焦虑。</p>\n<p>他说，他马上就要30岁了。他的老板扎克伯格在30岁时时已经缔造了 Facebook；贝佐斯辞去了华尔街的副总裁职位，开始了 Amazon 的创业旅程；丁磊已经成为了中国首富；李彦宏也在这一年放弃了财务自由的硅谷生活，转身回到中国，创立了百度。远的不说，近处他有几个认识的同龄人在国内创业风生水起，千万投资，还有几个被评为 Forbes 30 Under 30。</p>\n<p>而他呢，不过一个程序员。30岁的时候依然在硅谷租着房子，至今没有感觉做出什么改变世界的产品。每当看到硅谷大华超市里面拖家带口的华人老工程师，他就觉得可以看穿未来 —— 十年后他也会是这样：挺着大肚子，带着孩子，为柴米油盐斤斤计较。</p>\n<p>我当时笑着说，你哪会那样。你现在只不过是少年维特的烦恼，你之前的生命如夏花般灿烂，这之后平凡也不会是唯一的答案。</p>\n<p>现在想想，我也许过于乐观了。现在超市里看到的华人工程师，他们当年都是国内数一数二的学霸，大多在没有父母支持的情况下，漂洋过海，学成毕业，留在硅谷（那个时候恐怕谷歌还没上市），真是比我们这代留学生优秀太多。即使这样，在我们这帮不知天高地厚的年轻人看来，他们也老了、无聊了、泯然众人矣了。十年之后，我们这代程序员，是否也会被后辈所鄙弃？</p>\n<p>这个问题我想无数人思考过，无论是国内的还是硅谷的，无论是不是程序员。当年扎克伯格一直为自己极客的身份感到自豪，也惧怕最后被世俗裹挟，成为所谓职场上指手画脚的老油条——于是他在自己名片上的职位 CEO 前加上了个“他妈的”；超级极客约翰卡马克在成为 Oculus CTO 之后，依然坚持每天写代码，一天不写就觉得浑身不舒服，要在推特上吐槽自己。</p>\n<p>这两个人直到今天依然很酷，依然是程序员心中的偶像。</p>\n<p>有人说，这两个人天赋异禀，骨骼惊奇，是万中无一的程序员。然而主流世界观就是，我们终将老去。科技行业的日新月异更是决定了，我们的代码终将被覆盖，我们做的产品终将会落寞，我们讨论的技术终将会淘汰，那我们程序员还剩下什么？</p>\n<p>神龟虽寿，犹有竟时。腾蛇乘雾，终为土灰。</p>\n<p>要回答这个问题，我想谈两位艺术家。一位是音乐之父巴赫，另一位是音乐神童莫扎特。前者生前是一位宫廷乐手，为王宫贵族谱曲，死后80年，他伟大的作品才在极其偶然的情况下被门德尔松发现；后者生前亦不受待见，英年早逝后无人送葬。</p>\n<p>这两个人在生前都是普普通通，绝不像迈克尔杰克逊那样家喻户晓，身前身后都粉丝无数。他们的平常工作，与我们程序员一样，不过我们写代码，他们写乐谱。</p>\n<p>我想，巴赫和莫扎特，在安安静静的谱写一首又一首曲目的时候，从来没有考虑过，他们以后会成为西方音乐的代名词。</p>\n<p>我们程序员也一样，也许在他人看来我们只是螺丝钉。但是我们敲下来的每一行代码，也许都将缔造不凡。</p>\n<p>史上最伟大的女程序员玛格丽特·汉密尔顿在为 NASA 写代码的时候，她负责的项目只是为了应对万分之一的意外事件，而她仍然兢兢业业地完成了工作。最后，她的程序真的发挥了作用，拯救了阿波罗计划。</p>\n<p>所以，我们程序员一定要功成名就吗？一定要荣耀显达吗？这才算是不平凡才是幸福吗？虽然写代码确实赚钱，但如果多年后退休的我回到公司，发现年轻时候我写的代码或者库依然在被广泛的使用，我会由衷的欣慰。</p>\n<p>作为一名年轻的程序员，我还想做出一些很酷的产品；还想在 Github 上开源一些程序供大家参考或者使用；我还想再写出一段段代码，让很多人的体验因为我的工作而不同。</p>\n<p>李开复老师前段时间在哥大演讲。看着他思维活跃，跟毕业生们畅谈人工智能，我依然觉得他是一位很酷的程序员。也许这就是程序员这份工作意义的所在：数十年之后，我们依然可以通过技术紧跟年轻人的世界，而年轻人依然觉得我们是一群很酷的极客。</p></div><br><br>作者：故胤道长<br>链接：http://www.jianshu.com/p/b78f1757b88c<br>來源：简书<br>著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。</div>"
    }
  ]
}