{
  "title": "一名中专生的坎坷程序人生",
  "cells": [
    {
      "type": "text",
      "data": "<div style=\"margin: 0px; padding: 10px 0px; color: rgb(39, 42, 48); font-family: &quot;Microsoft Yahei&quot;; font-size: 12px; text-align: center;\"><span style=\"font-size: 14px;\">现在IT界流行写自传（不要潮笑我，我是跟着潮流走。布什总统开始伊拉克战争的那句经典：Let\"s go)。我也以我的程序人生写一封我的程序人生之路吧（各位前辈，不要扔鸡蛋），以作为自勉。虽然我还是一名coder，但是作为我们这种背景（我说的背景是：学历低，喜欢程序，工作坎坷）的人真的感触很深。 我不记得在什么时侯在网上,应该是在csdn网上看到Banaler的一篇文章《一个程序员的自白》(相信你也看过)，觉得感触很深，我将他收藏起来了，我发现作者的经历和我有点类似，在我觉得无助时或感到自卑时，我会拿出来作为一种精神上的鼓励。一直以来，我就很想将我的程序人生记在日记中（虽然是多么的短暂），将来等我成功了的时侯，也想分享以前的那种经历。我想每个人的人生都有一部奋斗史。今天，也许是我的一时冲动，我提起了笔，写下了我的程序奋斗史，我想对我有用。</span><br></div><div class=\"post_content\" id=\"paragraph\" style=\"margin: 0px; padding: 0px; color: rgb(39, 42, 48); font-family: &quot;Microsoft Yahei&quot;; font-size: 12px;\"><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">先大致介绍一下我的情况：<br>我1997年进入湖南的一所所谓的重点中专学校，开始选的是证券投资专业，最后我的一个亲戚（湖南司法学校的一位老师）将我的专业改成计算机专业（这是我自认为改变我一生的一个最大的转折点）。从此我与计算机结下了不解之缘，我被计算机那种深不可测，却又很想去探个究竟，深深地吸引住了，我想这也是很多人喜欢计算机的一个原因吧。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">因为我们是中专，在学校也没有学到什么东西。我一年级和二年级还是很老实的，学习很认真，还拿过几次奖学金，成绩也是班上前几名。那个时侯我心浮气躁，因为学校开设的专业课很少，基本上都是些数学，英语，语文等基础课程，我当时只对专业课程，英语，数学这几名课程感兴趣。那个时侯，我还买了一台学习机，因为买不起电脑。虽然那个时侯自认为没有学到什么，那个时侯我也经常安慰自已：幸好我那个时侯练就了一身打字的本领（现在想来真的有点无知，好笑），要不然我怎么写程序，我参加过我们学校的几次打字比赛我都是前几名。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">第二年学了一点关于数据库的知识，这也对我以后的学习有一些影响。第三年，我就慢慢地变得堕落了，从那个时侯起我学会了打泡胡，只要不是计算机专业和英语课，我就全部不在，出去打牌去了，被学生科抓过好多次，警告过好多次，但依旧改变不了，第三年，第四年上半年是糊里糊涂地过去了，最让我后悔的是自考没有坚持下去（至今仍影响着我的成长）。所幸的是，我们学校有一个好老师（是我们学校计算机的权威），教学的方法（他教书的方法是“授人以渔，而不是授人以鱼”，详见《程序员》杂志侯捷写的那篇文章），教了我们几名课程（我记得有C语言，数据库原理），凭借着他那点思想，也是那个时侯对编程很感兴趣，基本上我现在的编程知识全都是毕业之后学来的，且听我娓娓道来。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">在2001年上半年，也就是我们毕业的最后一个学期，我们学校开始组织我们实习。我没有跟着学校走，我跟着我表哥（对我影响最大的，也是我最尊敬的）于2001年初8来到了长沙，开始找工作。由于我的依赖性思想特别严重（现在工作上完全没有了，生活上还是有，我认为这是每个人都有的一种弱点），所以好长一段时间（大概有2个星期）我自已都没有出去找过工作，现在想起来那个时侯真的不懂事。后来，我哥哥逼着我去人才市场找工作，我第一次也试着性的去了湖南人才市场，那个时侯看见人很多，而且都是大学生，我退缩了（可想而知我在学校里是多么的内向，多么的本份），没有进去，因为我这个人从某种程度上有点自卑，我哥哥知道我没有去，他做了我很久的思想工作（我现在都还记忆犹新，我想这应该是我的福分吧－我有一个很好的表哥）。第二次我去了人才市场，那时也有点走运，居然被湖南湘财信息产业有限公司智能卡分公司（湘财证券的姐妹公司，同属湖南大学的校办企业）录取了，做智能卡维护工作（一直到现在我还在智能卡行业，金卡工程），也许是这份工作来得太容易了，或许是我根本不懂事，由于我的种种原因，做了两个星期，我被公司行政部门叫过去，简单地说了一句“你不适合做我们这份工作”，我也就这样被淘汰了（我现在想起来，真的觉得很惨愧，这么好的一份工作，居然没有去珍惜）。<br>又在哥哥（我哥哥在一所大专院校教书）家里呆了二个多星期，那一段时间，出去过几次，但都没有结果。最后，哥哥将我介绍到了长沙合一电脑城的一家电脑公司做技术员，那家公司的老总是我哥哥的朋友的同学（够复杂吧），师大毕业的。从这个时期，我经常加班（由于我和老板的关系，我有公司的钥匙），为的就是利用这段时间去学习编程，看MSDN。由于我的工作是硬件维护，我向来对硬件不感兴趣，但没办法，我要吃饭，我做了一个多月后。我就去读了学校的对口招生，为的是在社会上有我的一席之地。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我去读学校的对口招生了（这时已经到了2001年4月中旬了），由于我迟到了很久以及其它原因，最后，我读了大约20来天（这一段时间我很用功），就放弃了（这时是5月10几了）。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我在我哥哥家里思考了一段时间（在这一段时间中我读完了卫斯理的基本上所有的科幻小说，我现在很喜欢科幻电影，很大一部分就是那个时侯的影响，我也慢慢地有了思考问题的一些想法，我认为学习编程很需要一种解决问题的逻辑思维，其实多看看科幻小说也有好处）。这一段时间，也是我情绪最差的时侯，我哥哥的一位朋友（在电信局工作，还有一点权势）问我想不想去工厂，在那个时侯我甚至也有了这样的想法（先去工厂工作，在工作的同时，也可以学习我的编程），最后我还是没有去。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">过了两天，我在长沙找到了一份与软件开发没有什么关联的工作，一个做智能卡系统集成公司的技术员，做系统维护。在这过程中我们接了一个软件单，我也很幸运地和我另外的一个同事开始了软件开发，我的软件开发技术也就是这个时侯突飞猛进的前进，从不怎么懂到慢慢入门，到写项目。由于客户的各种原因（最后听说是客户财政危机，公司倒闭了），最终这个项目没有被应用。老板就将责任推托到我们身上，最后老板终止了接软件项目，就让我做系统维护，甚至还帮业务部门送货。我最气的是，我下了班之后，想利用晚上的时间，学习一下，老板居然说，电脑太耗电，电费很高。也就这样，我只能在工作的时侯，在没有事的时侯挤出时间去看MSDN,SQL SERVER OnlineBook，晚上看书。这一段时间进步很慢，很平淡。我甚至有一点想放弃这个行业，转去做网络（我有一个同学在华为的合作伙伴，收入还可以），因为我太喜欢编程了，也就坚持了下来。我在这个公司差不多做了7个多月。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">在2002年2月份，我辞职了。去了华为的一家合作伙伴（我同学在那里工作，我同学一开始都不知道，困为他常驻江西，我也没有告诉他，因为我想去改变我的依赖性），做电信网络硬件安装，由于我一点都不适合于做硬件。最后，我没有做下去，在这里我学到了很多关于网络的知识，当然是我自认为，在这里我真的很感谢这家公司。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我去了一家智能卡系统集成的公司，公司是我以前服务过的客户，也是同行，刚好公司需要做一个软件项目，（公司不是做软件的，也没有做软件的兴趣）我以前也做过同类型的项目，所以我就接管了这个项目。经过了2个多月的开发时间，开发完成了，验收了，在这一段时间，我才算真真地做了我自已喜欢的工作。做完了这个项目之后，我就没事做了，由于我做的是系统维护，基本上都是在出差，或为客户服务。在后面的4个多月时间里，我有很多的空余时间学习软件知识，也就是这一段时间，我的软件技术再一次地飞速地发展。在这一段时间，我学习了MCSE，没有去考，只是看了光盘，最后成了一名coder。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">大概是2002年11月份，深圳的一家公司（我们是他们的代理商）问我想不想去深圳，他们希望我去深圳，待遇也比这里好，我有点犹豫。其实我的想法是，在长沙好好呆几年，考个大专然后南下或北上。在我咨询了我的好朋友和我的哥哥之后，我决定去深圳。也就是2002年11月下旬，我踏上了深圳这块土地，这里是中国改革开改的见证地，中国IT行业最发达的地方，一个朝气逢勃的城市，也是我最想去的几个城市之一。从此，我终于做上了一名真正的coder,成了一名真正的程序员，也成了IT行业的一员。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我现在的这个公司是一个小公司，是香港公司在深圳的办事处，做智能系统的开发，无线通信等产品。我的工作就是开发公司硬件对应的软件产品，以及演示模块。我已经做了很多个项目了，现在使用Microsoft .Net技术进行开发，我个人也正在学习C#。以下是对我改变最大的，也是我认为对我影响最大的几点，我想可能对正在徘徊中的人也有用：<br><br>1、多看看科幻小说。我看了卫斯理全系列科幻小说，懂得了逆向思考的思维，对软件开发很有用。<br>软件开发说白了就是使用计算机语言解决人类所需要的问题，是问题解决的计算机表现形式。当然从技术上来说，软件＝算法＋数据结构</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">2、认识了《程序员》杂志和CSDN网站<br>我从《程序员》杂志的2001年第三期，我就每一期必买，我现在所有的《程序员》有20多本。这也是对我影响最大的地方。也使我认识了侯捷，蔡学庸、李维、蒋涛等IT精英。也纠正了我以前的很多错误的看法，特别是指导我买书的原则，我现在算来最少买了700多元的垃圾书（那个时侯买的都是国内的书，什么入门，宝典，我现在再也不买国人写的书了，不是我偏见）。我现在买书全都参考《程序员》的书评以及China-pub的书评来购买，包括Design Pattern,Applied Microsoft .NET Framework Programming(Jeffrey Richter),Programming Application for Microsfot Windows(中文版Windows高级编程) 。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">3、看书最好看原版书<br>其实我英语很差的，只有CET-3级，我看到Jeffrey Richter的名著《Applied Microsoft .NET Framework Programming》被清华大学翻译成那个样子（网上书评），我买了中文版根本无法看下去（句子不通，语法不正确，歪曲作者的原意，我怀意国人都看不懂那里面的意思）。就又买了英文版，虽然我有中文版，现在我已经看了2个多月了，全都是看英文版。我的英文也好多了，当然我看的时侯是打开电脑，对着金山词霸看，我现在可以很少看金山词霸，也大致知道其中的意思。我想奉劝各位的是不要一时心血来潮，就看，一定要坚持下去，不要一开始看一下了，慢慢地就放弃了，要沉下心来。像侯捷说的“台上一分钟，台下十年功”，不坚持是不行的。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">4、学习软件开发不能心浮气躁，这是很多人的通病，我比较来重，包括心血来潮。<br>软件技术牵涉到很多基础课程，不是一两天或者一两个月就能够学好的。只要我心浮气躁的时侯，我就会拿起《程序员》杂志合订本中的侯捷写的文章勉历自已，慢慢使自已的心静下来，也可以喝杯咖啡，看看蔡学镛的《Java夜未眠》（当然，这本书才出不久），李维的《Borland传奇》缓解一下自已的情绪。（其实多看看散文也不错）</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">5、编写程序时，一定要尊守一些准则（如Microsoft .NET Framework就有一个指导开发类库的Convention),这点特别重要<br>我有时看到一些原代码，又没有注释，变量命名全都是拼音命名，或什么i,j,a,a1等等之类的，代码缩进不规范，我就头痛，也就不看了，我认为这些都是垃圾，因为这种编写这种代码的人肯定没有想过别人。不要以为程序小，就不遵守约定俗成的规范，有句话说得好，“习惯决定性格，性格决定命运”。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">6、多上一些英文网站(<a href=\"http://www.codeproject.com/\" rel=\"external nofollow noreferrer\" style=\"color: rgb(77, 166, 255); outline: none medium;\">www.codeproject.com</a>,&nbsp;<a href=\"http://www.codeproject.com/\" rel=\"external nofollow noreferrer\" style=\"color: rgb(77, 166, 255); outline: none medium;\">http://www.codeproject.com</a>等)，多订一些英文新闻组(microsoft.public.dotnet.languages.csharp等相关之类的），尽可能地多与英文打招道。<br>真的，这点很重要，我是这半年才体会到的，现在对计算机技术英文没有以前那么反感。我记得《程序员》杂志上有很多文章（都是些专家）都鼓励我们尽可能地去看英文技术资料，哪怕看不懂，我现在深有感触。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">7、学习时最好能做技术笔记，将一些对书内容所感所想，全都记录下来，也许对以后项目开发很有用。<br>这是我在看书中体会到的。君不见CSDN上那么多读书笔记，那都是读者对作者书的内容的一些自身的理解，是自已对书的内容的一种全文贯通的理解的效果。那些笔记是自已看的，而不是做给别人看的，真的很有用。说不定哪天哪个项目急需解决的问题已在你的读书笔记中记录下来，那是看书时的灵感所在，可能过来了段时间就消失了。我不知道大家有没有出现过这种情形，项目中一个很难解决的问题，你想了几天，甚至一个星期，都没有想到解决问题的办法，突然在你看书（技术书，散文）时或在看电视时或在散步时或在睡觉时，类似问题的解决办法浮现在你的脑海中，我想这时的解决办法一般都是有效的，只不过这只是我个人的看法，我只碰到过几次这种情形，这时你也是很兴奋的。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我一直都在想，我有幸成为了一名程序员（只是一名coder),可以感爱程序员行业所带来的酸甜苦辣，可以感受当我解决程序开发中某个问题时给我带来的成就感，以及程序生涯中带给我的快乐，我喜欢和计算机相处，也喜欢排除Bug的那种快感，这是我不甘心禄禄无为的后果（当然是我自认为）；我又不幸成为了一名程序员，成为了一名没有自已的黑夜，没有女朋友，没有money,在别人眼里只知道写程序的IT人，没完没了的写程序。同时又要学习各种新的技术，简直是太累了，每天晚上都是12点多才离开计算机，每天呆在电脑旁边的时间不会少于15个小时，我有时真的很想睡一觉，很想去旅游一段时间，很想和女朋友去玩个够。但是我不能，因为我是个程序员，这是个变幻莫测的行业，我知道某个时侯等我一觉醒来，我发现我离这个行业已经有一点距离了。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">等我写完了这篇文章的时侯，已经凌晨2点多了。在深圳的这个时侯，不是很活跃，毕竟这里是中国的窗口。我相信还有很多和我一样的人还在工作着，还在为自已的前途奋斗着，还在为自已的激情坚持着。我也不知道什么时侯，我的激情会被无情的现实给冲淡了，我也不敢去想那些问题，越想越害怕，我也不敢想“30多岁了你能做什么”这个话题，也许对于我来说，只有时间能够知道。</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我的Email是[email protected]，欢迎志同道合的同志能与我交流</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">我的MSN:[email protected]，我很少用QQ,也反感用QQ</p><p style=\"margin: 0px; padding: 10px 0px; font-size: 14px; line-height: 22px; word-wrap: break-word;\">Jesee Qing&nbsp;<br>2003.7.22日凌晨2点13分<br>写于深圳</p></div>"
    }
  ]
}